JimKueneman/OpenLcbCLib/src/applications/dspic/OpenLcb_Basic_Node.X/main.c
};

const interface_openlcb_protocol_snip_t interface_openlcb_protocol_snip = {

    .configuration_memory_read = CONFIG_MEM_READ_FUNC

};

const interface_protocol_config_mem_read_handler_t interface_protocol_config_mem_read_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message,
    
    // Callbacks
    .on_read_space_config_decscription_info = NULL,
    .on_read_space_all = NULL,
    .on_read_space_configuration_memory = NULL,
    .on_read_space_acdi_manufacturer = NULL,
    .on_read_space_acdi_user = NULL,
    .on_read_space_traction_config_decscription_info = NULL,
    .on_read_space_traction_config_memory = NULL

};

const interface_protocol_config_mem_write_handler_t interface_protocol_config_mem_write_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message,
    
    // Callbacks
    .on_write_space_config_decscription_info = NULL,
    .on_write_space_all = NULL,
    .on_write_space_configuration_memory = NULL,
    .on_write_space_acdi_manufacturer = NULL,
    .on_write_space_acdi_user = NULL,
    .on_write_space_traction_config_decscription_info = NULL,
    .on_write_space_traction_config_memory = NULL

};

const interface_protocol_config_mem_operations_handler_t interface_protocol_config_mem_operations_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message

};

// TODO Finish these interfaces
// -------------------------------

const interface_protocol_datagram_handler_t interface_protocol_datagram_handler = {

    // Config Memory Read 
    .memory_read_space_config_description_info = &ProtocolConfigMemReadHandler_memory_read_space_config_description_info,
    .memory_read_space_all = &ProtocolConfigMemReadHandler_memory_read_space_all,
    .memory_read_space_configuration_memory = &ProtocolConfigMemReadHandler_memory_read_space_configuration_memory,
    .memory_read_space_acdi_manufacturer = &ProtocolConfigMemReadHandler_memory_read_space_acdi_manufacturer,
    .memory_read_space_acdi_user = &ProtocolConfigMemReadHandler_memory_read_space_acdi_user,
    .memory_read_space_traction_function_definition_info = &ProtocolConfigMemReadHandler_memory_read_space_traction_function_definition_info,
    .memory_read_space_traction_function_config_memory = &ProtocolConfigMemReadHandler_memory_read_space_traction_function_config_memory,

    // Config Memory Read Reply Ok 
    .memory_read_space_config_description_info_reply_ok = NULL,
    .memory_read_space_all_reply_ok = NULL,
    .memory_read_space_configuration_memory_reply_ok = NULL,
    .memory_read_space_acdi_manufacturer_reply_ok = NULL,
    .memory_read_space_acdi_user_reply_ok = NULL,
    .memory_read_space_traction_function_definition_info_reply_ok = NULL,
    .memory_read_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Read Reply Failed
    .memory_read_space_config_description_info_reply_fail = NULL,
    .memory_read_space_all_reply_fail = NULL,
    .memory_read_space_configuration_memory_reply_fail = NULL,
    .memory_read_space_acdi_manufacturer_reply_fail = NULL,
    .memory_read_space_acdi_user_reply_fail = NULL,
    .memory_read_space_traction_function_definition_info_reply_fail = NULL,
    .memory_read_space_traction_function_config_memory_reply_fail = NULL,
    
    // Config Memory Stream Read
    .memory_read_stream_space_config_description_info = NULL,
    .memory_read_stream_space_all = NULL,
    .memory_read_stream_space_configuration_memory = NULL,
    .memory_read_stream_space_acdi_manufacturer = NULL,

    // Config Memory Stream Read Reply = Ok
    .memory_read_stream_space_config_description_info_reply_ok = NULL,
    .memory_read_stream_space_all_reply_ok = NULL,
    .memory_read_stream_space_configuration_memory_reply_ok = NULL,
    .memory_read_stream_space_acdi_manufacturer_reply_ok = NULL,
    .memory_read_stream_space_acdi_user_reply_ok = NULL,
    .memory_read_stream_space_traction_function_definition_info_reply_ok = NULL,
    .memory_read_stream_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Stream Read Reply = Failed
    .memory_read_stream_space_config_description_info_reply_fail = NULL,
    .memory_read_stream_space_all_reply_fail = NULL,
    .memory_read_stream_space_configuration_memory_reply_fail = NULL,
    .memory_read_stream_space_acdi_manufacturer_reply_fail = NULL,
    .memory_read_stream_space_acdi_user_reply_fail = NULL,
    .memory_read_stream_space_traction_function_definition_info_reply_fail = NULL,
    .memory_read_stream_space_traction_function_config_memory_reply_fail = NULL,

    // Config Memory Write 
    .memory_write_space_config_description_info = NULL,
    .memory_write_space_all = NULL,
    .memory_write_space_configuration_memory = NULL,
    .memory_write_space_acdi_manufacturer = NULL,
    .memory_write_space_acdi_user = NULL,
    .memory_write_space_traction_function_definition_info = NULL,
    .memory_write_space_traction_function_config_memory = NULL,
    .memory_write_space_firmware_upgrade = NULL,

    // Config Memory Write Reply Ok 
    .memory_write_space_config_description_info_reply_ok = NULL,
    .memory_write_space_all_reply_ok = NULL,
    .memory_write_space_configuration_memory_reply_ok = NULL,
    .memory_write_space_acdi_manufacturer_reply_ok = NULL,
    .memory_write_space_acdi_user_reply_ok = NULL,
    .memory_write_space_traction_function_definition_info_reply_ok = NULL,
    .memory_write_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Write Reply Fail
    .memory_write_space_config_description_info_reply_fail = NULL,
    .memory_write_space_all_reply_fail = NULL,
    .memory_write_space_configuration_memory_reply_fail = NULL,
    .memory_write_space_acdi_manufacturer_reply_fail = NULL,
    .memory_write_space_acdi_user_reply_fail = NULL,
    .memory_write_space_traction_function_definition_info_reply_fail = NULL,
    .memory_write_space_traction_function_config_memory_reply_fail = NULL,

    // Config Memory Write Under Mask
    .memory_write_under_mask_space_config_description_info = NULL,
    .memory_write_under_mask_space_all = NULL,
    .memory_write_under_mask_space_configuration_memory = NULL,
    .memory_write_under_mask_space_acdi_manufacturer = NULL,
    .memory_write_under_mask_space_acdi_user = NULL,
    .memory_write_under_mask_space_traction_function_definition_info = NULL,
    .memory_write_under_mask_space_traction_function_config_memory = NULL,
    .memory_write_under_mask_space_firmware_upgrade = NULL,

