JimKueneman/OpenLcbCLib/src/applications/dspic/OpenLcb_Basic_Node.X/main.c
    // Config Memory Stream Write
    .memory_write_stream_space_config_description_info = NULL,
    .memory_write_stream_space_all = NULL,
    .memory_write_stream_space_configuration_memory = NULL,
    .memory_write_stream_space_acdi_manufacturer = NULL,
    .memory_write_stream_space_acdi_user = NULL,
    .memory_write_stream_space_traction_function_definition_info = NULL,
    .memory_write_stream_space_traction_function_config_memory = NULL,
    .memory_write_stream_space_firmware_upgrade = NULL,
    
    // Config Memory Stream Write Reply = Ok
    .memory_write_stream_space_config_description_info_reply_ok = NULL,
    .memory_write_stream_space_all_reply_ok = NULL,
    .memory_write_stream_space_configuration_memory_reply_ok = NULL,
    .memory_write_stream_space_acdi_manufacturer_reply_ok = NULL,
    .memory_write_stream_space_acdi_user_reply_ok = NULL,
    .memory_write_stream_space_traction_function_definition_info_reply_ok = NULL,
    .memory_write_stream_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Stream Write Reply = Failed
    .memory_write_stream_space_config_description_info_reply_fail = NULL,
    .memory_write_stream_space_all_reply_fail = NULL,
    .memory_write_stream_space_configuration_memory_reply_fail = NULL,
    .memory_write_stream_space_acdi_manufacturer_reply_fail = NULL,
    .memory_write_stream_space_acdi_user_reply_fail = NULL,
    .memory_write_stream_space_traction_function_definition_info_reply_fail = NULL,
    .memory_write_stream_space_traction_function_config_memory_reply_fail = NULL,
    
    // Config Memory Commands
    .memory_options_cmd = NULL,
    .memory_options_reply = NULL,
    .memory_get_address_space_info = NULL,
    .memory_get_address_space_info_reply_not_present = NULL,
    .memory_get_address_space_info_reply_present = NULL,
    .memory_reserve_lock = NULL,
    .memory_reserve_lock_reply = NULL,
    .memory_get_unique_id = NULL,
    .memory_get_unique_id_reply = NULL,
    .memory_unfreeze = NULL,
    .memory_freeze = NULL,
    .memory_update_complete = NULL,
    .memory_reset_reboot = NULL,
    .memory_factory_reset = NULL,

    .lock_shared_resources = LOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE
    .unlock_shared_resources = UNLOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE

};

//interface_openlcb_protocol_datagram_config_mem_handler_t interface_openlcb_protocol_datagram_config_mem_handler = {
//
//    .configuration_memory_read = NULL,
//    .configuration_memory_write = NULL,
//    .reboot = NULL,
//    .configuration_memory_factory_reset = NULL,
//    .snip_load_manufacturer_version_id = &ProtocolSnip_load_manufacturer_version_id,
//    .snip_load_name = &ProtocolSnip_load_name,
//    .snip_load_model = &ProtocolSnip_load_model,
//    .snip_load_hardware_version = &ProtocolSnip_load_hardware_version,
//    .snip_load_software_version = &ProtocolSnip_load_software_version,
//    .snip_load_user_version_id = &ProtocolSnip_load_user_version_id,
//    .snip_load_user_name = &ProtocolSnip_load_user_name,
//    .snip_load_user_description = &ProtocolSnip_load_user_description,
//    .clear_resend_datagram_message = &ProtocolDatagramHandler_clear_resend_datagram_message,
//    // Callback events
//    .on_configuration_memory_factory_reset = NULL,
//    .on_config_mem_write = NULL,
//    .on_config_mem_freeze_firmware_update = NULL,
//    .on_config_mem_unfreeze_firmware_update = NULL
//
//};

const interface_openlcb_application_t interface_openlcb_application = {

    .transmit_openlcb_message = NULL,
    .configuration_memory_read = NULL,
    .configuration_memory_write = NULL

};

void _initialize_io_early_for_test(void) {


    ANSELA = 0x00; // Convert all I/O pins to digital
    ANSELB = 0x00;
    ANSELC = 0x00;
    ANSELE = 0x00;


    LED_BLUE_TRIS = 0;
    LED_GREEN_TRIS = 0;
    LED_YELLOW_TRIS = 0;

    TEST_PIN_1401_TRIS = 0;
    TEST_PIN_1402_TRIS = 0;
    TEST_PIN_1403_TRIS = 0;
    TEST_PIN_1404_TRIS = 0;

}

int main(void) {

    _initialize_io_early_for_test();

    Ecan1Helper_initialize();
    BasicNodeDrivers_initialize();

    printf("MCU Initialized\n");

    CanBufferStore_initialize();
    CanBufferFifo_initialize();

    CanRxMessageHandler_initialize(&interface_can_rx_message_handler);
    CanRxStatemachine_initialize(&interface_can_rx_statemachine);

    CanTxMessageHandler_initialize(&interface_can_tx_message_handler);
    CanTxStatemachine_initialize(&interface_can_tx_statemachine);

    CanLoginMessageHandler_initialize(&interface_can_login_message_handler);
    CanLoginStateMachine_initialize(&interface_can_login_state_machine);
    CanMainStatemachine_initialize(&interface_can_main_statemachine);

    AliasMappings_initialize();

    OpenLcbBufferStore_initialize();
    OpenLcbBufferList_initialize();
    OpenLcbBufferFifo_initialize();

    ProtocolSnip_initialize(&interface_openlcb_protocol_snip);
    //  ProtocolDatagramConfigMemHandler_initialize(&interface_openlcb_protocol_datagram_config_mem_handler);
    ProtocolDatagramHandler_initialize(&interface_protocol_datagram_handler);
    ProtocolEventTransport_initialize(&interface_openlcb_protocol_event_transport);
    ProtocolMessageNetwork_initialize(&interface_openlcb_protocol_message_network);
    ProtocolConfigMemReadHandler_initialize(&interface_protocol_config_mem_read_handler);
    ProtocolConfigMemWriteHandler_initialize(&interface_protocol_config_mem_write_handler);
    ProtocolConfigMemOperationsHandler_initialize(&interface_protocol_config_mem_operations_handler);

    OpenLcbNode_initialize(&interface_openlcb_node);

    OpenLcbLoginMessageHandler_initialize(&interface_openlcb_login_message_handler);
    OpenLcbLoginStateMachine_initialize(&interface_openlcb_login_state_machine);
    OpenLcbMainStatemachine_initialize(&interface_openlcb_main_statemachine);

    OpenLcbApplication_initialize(&interface_openlcb_application);

    OpenLcbNode_allocate(NODE_ID + 5, &NodeParameters_main_node);

    printf("Does it work?\n");

    while (1) {

        // Run the main Openlcb/LCC engine
        CanMainStateMachine_run();
        OpenLcbLoginMainStatemachine_run();
        OpenLcbMainStatemachine_run();

    }
}
